# Pandas

#### Dataframes and Series

- dataframes is a multidimensional
- series is a one dimensional

In [1]:
# importing the libraries
import numpy as np
import pandas as pd

In [2]:
# creating a series
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
# creating a dataframe by passing a numpy array
dates = pd.date_range('20130101', periods=6)

In [5]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [7]:
df

                   A         B         C         D
2013-01-01  2.282056 -1.630972  1.678128  0.856477
2013-01-02  0.305370  0.337857  0.579338  0.305793
2013-01-03 -0.593387  1.547751  1.019960  0.662074
2013-01-04  0.582260  0.978277  0.990363 -0.069249
2013-01-05 -0.293823  0.285029  1.135584  1.223455
2013-01-06  0.442842  2.756407  0.297858 -0.261494

In [8]:
# get 1st row
df.iloc[0]

A    2.282056
B   -1.630972
C    1.678128
D    0.856477
Name: 2013-01-01 00:00:00, dtype: float64

In [9]:
df.head(1)

                   A         B         C         D
2013-01-01  2.282056 -1.630972  1.678128  0.856477

In [10]:
# get columns
df.A

2013-01-01    2.282056
2013-01-02    0.305370
2013-01-03   -0.593387
2013-01-04    0.582260
2013-01-05   -0.293823
2013-01-06    0.442842
Freq: D, Name: A, dtype: float64

In [11]:
labels = ['W', 'X', 'Y', 'Z']
list = [10, 20, 30, 40]
array = np.array([10, 20, 30, 40])
dict = {'w': 10, 'x': 30, 'y': 20, 'z': 40}

In [12]:
pd.Series(data=list)

0    10
1    20
2    30
3    40
dtype: int64

In [13]:
pd.Series(data=list, index=labels)

W    10
X    20
Y    30
Z    40
dtype: int64

In [14]:
# creating a series based on a dictionary
pd.Series(dict)

w    10
x    30
y    20
z    40
dtype: int64

In [15]:
a = {'w': 10, 'x': [30, 45, 89], 'y': ('ab', 'cd', 'ef'), 'z': {'a': 56, 'b': 89}}

In [16]:
pd.Series(a)

w                    10
x          [30, 45, 89]
y          (ab, cd, ef)
z    {'a': 56, 'b': 89}
dtype: object

#### indexing a series

In [17]:
sports1 = pd.Series([1, 2, 3, 4], index= ['Cricket', 'Football', 'Basketball', 'Golf'])

In [18]:
sports2 = pd.Series([1, 2, 5, 4], index= ['Cricket', 'Hockey', 'Basketball', 'Golf'])

In [19]:
sports1

Cricket       1
Football      2
Basketball    3
Golf          4
dtype: int64

In [20]:
sports2

Cricket       1
Hockey        2
Basketball    5
Golf          4
dtype: int64

In [21]:
sports1['Cricket']

1

##### Operations are also done based on index

In [22]:
sports1 + sports2

Basketball    8.0
Cricket       2.0
Football      NaN
Golf          8.0
Hockey        NaN
dtype: float64

In [23]:
np.random.seed(100)   # to fix the changing nature of random
dataframe = pd.DataFrame(np.random.randn(10, 5), index = 'A B C D E F G H I J'.split(), columns='Score1 Score2 Score3 Score4 Score5'.split())

In [24]:
dataframe

     Score1    Score2    Score3    Score4    Score5
A -1.749765  0.342680  1.153036 -0.252436  0.981321
B  0.514219  0.221180 -1.070043 -0.189496  0.255001
C -0.458027  0.435163 -0.583595  0.816847  0.672721
D -0.104411 -0.531280  1.029733 -0.438136 -1.118318
E  1.618982  1.541605 -0.251879 -0.842436  0.184519
F  0.937082  0.731000  1.361556 -0.326238  0.055676
G  0.222400 -1.443217 -0.756352  0.816454  0.750445
H -0.455947  1.189622 -1.690617 -1.356399 -1.232435
I -0.544439 -0.668172  0.007315 -0.612939  1.299748
J -1.733096 -0.983310  0.357508 -1.613579  1.470714

In [25]:
dataframe['Score1']

A   -1.749765
B    0.514219
C   -0.458027
D   -0.104411
E    1.618982
F    0.937082
G    0.222400
H   -0.455947
I   -0.544439
J   -1.733096
Name: Score1, dtype: float64

In [26]:
dataframe[['Score1', 'Score2']]

     Score1    Score2
A -1.749765  0.342680
B  0.514219  0.221180
C -0.458027  0.435163
D -0.104411 -0.531280
E  1.618982  1.541605
F  0.937082  0.731000
G  0.222400 -1.443217
H -0.455947  1.189622
I -0.544439 -0.668172
J -1.733096 -0.983310

In [27]:
type(dataframe[['Score1', 'Score2']])

pandas.core.frame.DataFrame

#### Adding a new column to the Dataframe

In [28]:
dataframe['Score6'] = dataframe['Score1'] + dataframe['Score2']

In [29]:
dataframe

     Score1    Score2    Score3    Score4    Score5    Score6
A -1.749765  0.342680  1.153036 -0.252436  0.981321 -1.407085
B  0.514219  0.221180 -1.070043 -0.189496  0.255001  0.735399
C -0.458027  0.435163 -0.583595  0.816847  0.672721 -0.022863
D -0.104411 -0.531280  1.029733 -0.438136 -1.118318 -0.635692
E  1.618982  1.541605 -0.251879 -0.842436  0.184519  3.160587
F  0.937082  0.731000  1.361556 -0.326238  0.055676  1.668083
G  0.222400 -1.443217 -0.756352  0.816454  0.750445 -1.220817
H -0.455947  1.189622 -1.690617 -1.356399 -1.232435  0.733675
I -0.544439 -0.668172  0.007315 -0.612939  1.299748 -1.212611
J -1.733096 -0.983310  0.357508 -1.613579  1.470714 -2.716406

#### Removing the columns from dataframe

In [30]:
dataframe.drop('Score6', axis=1) # will create a new dataframe with column removed and the existing dataframe remained unharmed

     Score1    Score2    Score3    Score4    Score5
A -1.749765  0.342680  1.153036 -0.252436  0.981321
B  0.514219  0.221180 -1.070043 -0.189496  0.255001
C -0.458027  0.435163 -0.583595  0.816847  0.672721
D -0.104411 -0.531280  1.029733 -0.438136 -1.118318
E  1.618982  1.541605 -0.251879 -0.842436  0.184519
F  0.937082  0.731000  1.361556 -0.326238  0.055676
G  0.222400 -1.443217 -0.756352  0.816454  0.750445
H -0.455947  1.189622 -1.690617 -1.356399 -1.232435
I -0.544439 -0.668172  0.007315 -0.612939  1.299748
J -1.733096 -0.983310  0.357508 -1.613579  1.470714

In [31]:
dataframe

     Score1    Score2    Score3    Score4    Score5    Score6
A -1.749765  0.342680  1.153036 -0.252436  0.981321 -1.407085
B  0.514219  0.221180 -1.070043 -0.189496  0.255001  0.735399
C -0.458027  0.435163 -0.583595  0.816847  0.672721 -0.022863
D -0.104411 -0.531280  1.029733 -0.438136 -1.118318 -0.635692
E  1.618982  1.541605 -0.251879 -0.842436  0.184519  3.160587
F  0.937082  0.731000  1.361556 -0.326238  0.055676  1.668083
G  0.222400 -1.443217 -0.756352  0.816454  0.750445 -1.220817
H -0.455947  1.189622 -1.690617 -1.356399 -1.232435  0.733675
I -0.544439 -0.668172  0.007315 -0.612939  1.299748 -1.212611
J -1.733096 -0.983310  0.357508 -1.613579  1.470714 -2.716406

In [32]:
dataframe.drop('Score6', axis=1, inplace=True) # will overwrite the existing dataframe and remove the column

In [33]:
dataframe

     Score1    Score2    Score3    Score4    Score5
A -1.749765  0.342680  1.153036 -0.252436  0.981321
B  0.514219  0.221180 -1.070043 -0.189496  0.255001
C -0.458027  0.435163 -0.583595  0.816847  0.672721
D -0.104411 -0.531280  1.029733 -0.438136 -1.118318
E  1.618982  1.541605 -0.251879 -0.842436  0.184519
F  0.937082  0.731000  1.361556 -0.326238  0.055676
G  0.222400 -1.443217 -0.756352  0.816454  0.750445
H -0.455947  1.189622 -1.690617 -1.356399 -1.232435
I -0.544439 -0.668172  0.007315 -0.612939  1.299748
J -1.733096 -0.983310  0.357508 -1.613579  1.470714

#### Dropping rows

In [34]:
dataframe.drop('A', axis=0)

     Score1    Score2    Score3    Score4    Score5
B  0.514219  0.221180 -1.070043 -0.189496  0.255001
C -0.458027  0.435163 -0.583595  0.816847  0.672721
D -0.104411 -0.531280  1.029733 -0.438136 -1.118318
E  1.618982  1.541605 -0.251879 -0.842436  0.184519
F  0.937082  0.731000  1.361556 -0.326238  0.055676
G  0.222400 -1.443217 -0.756352  0.816454  0.750445
H -0.455947  1.189622 -1.690617 -1.356399 -1.232435
I -0.544439 -0.668172  0.007315 -0.612939  1.299748
J -1.733096 -0.983310  0.357508 -1.613579  1.470714

#### Accessing Columns

In [35]:
dataframe['Score1']

A   -1.749765
B    0.514219
C   -0.458027
D   -0.104411
E    1.618982
F    0.937082
G    0.222400
H   -0.455947
I   -0.544439
J   -1.733096
Name: Score1, dtype: float64

In [36]:
dataframe.Score1

A   -1.749765
B    0.514219
C   -0.458027
D   -0.104411
E    1.618982
F    0.937082
G    0.222400
H   -0.455947
I   -0.544439
J   -1.733096
Name: Score1, dtype: float64

#### Accessing the rows

In [37]:
dataframe.loc['C']

Score1   -0.458027
Score2    0.435163
Score3   -0.583595
Score4    0.816847
Score5    0.672721
Name: C, dtype: float64

In [38]:
dataframe.iloc[2]

Score1   -0.458027
Score2    0.435163
Score3   -0.583595
Score4    0.816847
Score5    0.672721
Name: C, dtype: float64

#### Selecting the subset of rows and columns

In [39]:
dataframe.loc['C', 'Score1']

-0.4580269855026243

In [40]:
dataframe.loc[['C', 'D'], 'Score1']

C   -0.458027
D   -0.104411
Name: Score1, dtype: float64

In [41]:
dataframe.loc[['C', 'D'], ['Score1']]

     Score1
C -0.458027
D -0.104411

In [42]:
dataframe.loc[['C', 'D'], ['Score1', 'Score2']]

     Score1    Score2
C -0.458027  0.435163
D -0.104411 -0.531280

#### Conditional Selection

In [43]:
dataframe

     Score1    Score2    Score3    Score4    Score5
A -1.749765  0.342680  1.153036 -0.252436  0.981321
B  0.514219  0.221180 -1.070043 -0.189496  0.255001
C -0.458027  0.435163 -0.583595  0.816847  0.672721
D -0.104411 -0.531280  1.029733 -0.438136 -1.118318
E  1.618982  1.541605 -0.251879 -0.842436  0.184519
F  0.937082  0.731000  1.361556 -0.326238  0.055676
G  0.222400 -1.443217 -0.756352  0.816454  0.750445
H -0.455947  1.189622 -1.690617 -1.356399 -1.232435
I -0.544439 -0.668172  0.007315 -0.612939  1.299748
J -1.733096 -0.983310  0.357508 -1.613579  1.470714

In [44]:
dataframe > 0.5

   Score1  Score2  Score3  Score4  Score5
A   False   False    True   False    True
B    True   False   False   False   False
C   False   False   False    True    True
D   False   False    True   False   False
E    True    True   False   False   False
F    True    True    True   False   False
G   False   False   False    True    True
H   False    True   False   False   False
I   False   False   False   False    True
J   False   False   False   False    True

In [45]:
dataframe.iloc[6] > 0.3

Score1    False
Score2    False
Score3    False
Score4     True
Score5     True
Name: G, dtype: bool

In [46]:
dataframe[dataframe>0.5]

     Score1    Score2    Score3    Score4    Score5
A       NaN       NaN  1.153036       NaN  0.981321
B  0.514219       NaN       NaN       NaN       NaN
C       NaN       NaN       NaN  0.816847  0.672721
D       NaN       NaN  1.029733       NaN       NaN
E  1.618982  1.541605       NaN       NaN       NaN
F  0.937082  0.731000  1.361556       NaN       NaN
G       NaN       NaN       NaN  0.816454  0.750445
H       NaN  1.189622       NaN       NaN       NaN
I       NaN       NaN       NaN       NaN  1.299748
J       NaN       NaN       NaN       NaN  1.470714

In [47]:
dataframe[ dataframe['Score1'] > 0.5 ]

     Score1    Score2    Score3    Score4    Score5
B  0.514219  0.221180 -1.070043 -0.189496  0.255001
E  1.618982  1.541605 -0.251879 -0.842436  0.184519
F  0.937082  0.731000  1.361556 -0.326238  0.055676

In [48]:
dataframe[ dataframe['Score1'] > 0.5 ]['Score2']

B    0.221180
E    1.541605
F    0.731000
Name: Score2, dtype: float64

In [49]:
dataframe

     Score1    Score2    Score3    Score4    Score5
A -1.749765  0.342680  1.153036 -0.252436  0.981321
B  0.514219  0.221180 -1.070043 -0.189496  0.255001
C -0.458027  0.435163 -0.583595  0.816847  0.672721
D -0.104411 -0.531280  1.029733 -0.438136 -1.118318
E  1.618982  1.541605 -0.251879 -0.842436  0.184519
F  0.937082  0.731000  1.361556 -0.326238  0.055676
G  0.222400 -1.443217 -0.756352  0.816454  0.750445
H -0.455947  1.189622 -1.690617 -1.356399 -1.232435
I -0.544439 -0.668172  0.007315 -0.612939  1.299748
J -1.733096 -0.983310  0.357508 -1.613579  1.470714

In [50]:
dataframe.reset_index()

  index    Score1    Score2    Score3    Score4    Score5
0     A -1.749765  0.342680  1.153036 -0.252436  0.981321
1     B  0.514219  0.221180 -1.070043 -0.189496  0.255001
2     C -0.458027  0.435163 -0.583595  0.816847  0.672721
3     D -0.104411 -0.531280  1.029733 -0.438136 -1.118318
4     E  1.618982  1.541605 -0.251879 -0.842436  0.184519
5     F  0.937082  0.731000  1.361556 -0.326238  0.055676
6     G  0.222400 -1.443217 -0.756352  0.816454  0.750445
7     H -0.455947  1.189622 -1.690617 -1.356399 -1.232435
8     I -0.544439 -0.668172  0.007315 -0.612939  1.299748
9     J -1.733096 -0.983310  0.357508 -1.613579  1.470714

In [51]:
newindex = 'IND JP CAN GE IT PL FY IU RT IP'.split()

In [52]:
newindex

['IND', 'JP', 'CAN', 'GE', 'IT', 'PL', 'FY', 'IU', 'RT', 'IP']

In [53]:
dataframe['Countries'] = newindex

In [54]:
dataframe

     Score1    Score2    Score3    Score4    Score5 Countries
A -1.749765  0.342680  1.153036 -0.252436  0.981321       IND
B  0.514219  0.221180 -1.070043 -0.189496  0.255001        JP
C -0.458027  0.435163 -0.583595  0.816847  0.672721       CAN
D -0.104411 -0.531280  1.029733 -0.438136 -1.118318        GE
E  1.618982  1.541605 -0.251879 -0.842436  0.184519        IT
F  0.937082  0.731000  1.361556 -0.326238  0.055676        PL
G  0.222400 -1.443217 -0.756352  0.816454  0.750445        FY
H -0.455947  1.189622 -1.690617 -1.356399 -1.232435        IU
I -0.544439 -0.668172  0.007315 -0.612939  1.299748        RT
J -1.733096 -0.983310  0.357508 -1.613579  1.470714        IP

In [55]:
dataframe.set_index('Countries', inplace=True)

In [56]:
dataframe

             Score1    Score2    Score3    Score4    Score5
Countries
IND       -1.749765  0.342680  1.153036 -0.252436  0.981321
JP         0.514219  0.221180 -1.070043 -0.189496  0.255001
CAN       -0.458027  0.435163 -0.583595  0.816847  0.672721
GE        -0.104411 -0.531280  1.029733 -0.438136 -1.118318
IT         1.618982  1.541605 -0.251879 -0.842436  0.184519
PL         0.937082  0.731000  1.361556 -0.326238  0.055676
FY         0.222400 -1.443217 -0.756352  0.816454  0.750445
IU        -0.455947  1.189622 -1.690617 -1.356399 -1.232435
RT        -0.544439 -0.668172  0.007315 -0.612939  1.299748
IP        -1.733096 -0.983310  0.357508 -1.613579  1.470714

#### Missing values

In [57]:
dataframe = pd.DataFrame({'Cricket': [1, 2, np.nan, 7, 8, np.nan], 'Baseball': [1, 2, 45, 7, 89, 56], 'Hockey': [np.nan, 2, np.nan, 7, 8, 56]})

In [58]:
dataframe

   Cricket  Baseball  Hockey
0      1.0         1     NaN
1      2.0         2     2.0
2      NaN        45     NaN
3      7.0         7     7.0
4      8.0        89     8.0
5      NaN        56    56.0

In [59]:
dataframe.dropna()

   Cricket  Baseball  Hockey
1      2.0         2     2.0
3      7.0         7     7.0
4      8.0        89     8.0

In [60]:
dataframe.dropna(axis=1)

   Baseball
0         1
1         2
2        45
3         7
4        89
5        56

In [61]:
dataframe

   Cricket  Baseball  Hockey
0      1.0         1     NaN
1      2.0         2     2.0
2      NaN        45     NaN
3      7.0         7     7.0
4      8.0        89     8.0
5      NaN        56    56.0

In [62]:
dataframe.dropna(thresh=1)

   Cricket  Baseball  Hockey
0      1.0         1     NaN
1      2.0         2     2.0
2      NaN        45     NaN
3      7.0         7     7.0
4      8.0        89     8.0
5      NaN        56    56.0

In [63]:
dataframe.dropna(thresh=2)

   Cricket  Baseball  Hockey
0      1.0         1     NaN
1      2.0         2     2.0
3      7.0         7     7.0
4      8.0        89     8.0
5      NaN        56    56.0

In [64]:
dataframe.fillna(value=00)

   Cricket  Baseball  Hockey
0      1.0         1     0.0
1      2.0         2     2.0
2      0.0        45     0.0
3      7.0         7     7.0
4      8.0        89     8.0
5      0.0        56    56.0

In [65]:
dataframe['Cricket'].fillna(value=dataframe['Cricket'].mean())

0    1.0
1    2.0
2    4.5
3    7.0
4    8.0
5    4.5
Name: Cricket, dtype: float64

#### Aggregate functions

In [66]:
data = {
  'CustID': ['1001', '1001', '1002', '1002', '1003', '1003'],
  'CustName': ['UIPat', 'DatRob', 'Goog', 'Chrysler', 'Ford', 'GM'],
  'ProfitinLakhs': [2005, 3245, 1569, 5698, 4563, 4562]
}

In [67]:
dataframe = pd.DataFrame(data)

In [68]:
dataframe

  CustID  CustName  ProfitinLakhs
0   1001     UIPat           2005
1   1001    DatRob           3245
2   1002      Goog           1569
3   1002  Chrysler           5698
4   1003      Ford           4563
5   1003        GM           4562

In [69]:
CustId_grouped = dataframe.groupby('CustID')

In [70]:
CustId_grouped.mean()

        ProfitinLakhs
CustID
1001           2625.0
1002           3633.5
1003           4562.5

In [71]:
dataframe.groupby('CustID').median()

        ProfitinLakhs
CustID
1001           2625.0
1002           3633.5
1003           4562.5

In [72]:
dataframe.groupby('CustID').count()

        CustName  ProfitinLakhs
CustID
1001           2              2
1002           2              2
1003           2              2

In [73]:
dataframe.groupby('CustID').max()

       CustName  ProfitinLakhs
CustID
1001      UIPat           3245
1002       Goog           5698
1003         GM           4563

In [74]:
dataframe.groupby('CustID').describe()

       ProfitinLakhs                                                         \
               count    mean          std     min      25%     50%      75%
CustID
1001             2.0  2625.0   876.812409  2005.0  2315.00  2625.0  2935.00
1002             2.0  3633.5  2919.643900  1569.0  2601.25  3633.5  4665.75
1003             2.0  4562.5     0.707107  4562.0  4562.25  4562.5  4562.75


           max
CustID
1001    3245.0
1002    5698.0
1003    4563.0

In [75]:
dataframe.groupby('CustID').describe().transpose()

CustID                      1001       1002         1003
ProfitinLakhs count     2.000000     2.0000     2.000000
              mean   2625.000000  3633.5000  4562.500000
              std     876.812409  2919.6439     0.707107
              min    2005.000000  1569.0000  4562.000000
              25%    2315.000000  2601.2500  4562.250000
              50%    2625.000000  3633.5000  4562.500000
              75%    2935.000000  4665.7500  4562.750000
              max    3245.000000  5698.0000  4563.000000

In [76]:
dataframe.groupby('CustID').describe().transpose()['1001']

ProfitinLakhs  count       2.000000
               mean     2625.000000
               std       876.812409
               min      2005.000000
               25%      2315.000000
               50%      2625.000000
               75%      2935.000000
               max      3245.000000
Name: 1001, dtype: float64

In [77]:
data1 = pd.DataFrame({
  'CustID': ['101', '104', '105', '106'],
  'Sales': [13456, 14563, 12563, 16542],
  'Payback': ['CAT4', 'CAT5', 'CAT6', 'CAT7'],
  'Imp': ['yes', 'no', 'yes', 'yes']
}, index=[8, 9, 10, 11])

In [78]:
data1

   CustID  Sales Payback  Imp
8     101  13456    CAT4  yes
9     104  14563    CAT5   no
10    105  12563    CAT6  yes
11    106  16542    CAT7  yes

In [79]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 8 to 11
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   CustID   4 non-null      object
 1   Sales    4 non-null      int64
 2   Payback  4 non-null      object
 3   Imp      4 non-null      object
dtypes: int64(1), object(3)
memory usage: 160.0+ bytes

In [80]:
data1.describe()

              Sales
count      4.000000
mean   14281.000000
std     1715.011565
min    12563.000000
25%    13232.750000
50%    14009.500000
75%    15057.750000
max    16542.000000

In [81]:
data1.describe(include='all')

       CustID         Sales Payback  Imp
count       4      4.000000       4    4
unique      4           NaN       4    2
top       101           NaN    CAT4  yes
freq        1           NaN       1    3
mean      NaN  14281.000000     NaN  NaN
std       NaN   1715.011565     NaN  NaN
min       NaN  12563.000000     NaN  NaN
25%       NaN  13232.750000     NaN  NaN
50%       NaN  14009.500000     NaN  NaN
75%       NaN  15057.750000     NaN  NaN
max       NaN  16542.000000     NaN  NaN

In [82]:
data2 = pd.DataFrame({
  'CustID': ['102', '103', '107', '108'],
  'Sales': [1365, 1463, 1263, 1642],
  'Mode': ['CAT1', 'CAT2', 'CAT4', 'CAT3'],
  'Prime': ['yes', 'yes', 'yes', 'no']
}, index=[1, 2, 3 ,4])

In [83]:
data3 = pd.DataFrame({
  'CustID': ['109', '110', '112', '111'],
  'Sales': [136, 143, 163, 162],
  'Priority': ['1', '2', '4', '3'],
  'Imp': ['yes', 'yes', 'yes', 'no']
}, index=[5, 6, 7, 8])

In [84]:
pd.concat([data1, data2, data3])

   CustID  Sales Payback  Imp  Mode Prime Priority
8     101  13456    CAT4  yes   NaN   NaN      NaN
9     104  14563    CAT5   no   NaN   NaN      NaN
10    105  12563    CAT6  yes   NaN   NaN      NaN
11    106  16542    CAT7  yes   NaN   NaN      NaN
1     102   1365     NaN  NaN  CAT1   yes      NaN
2     103   1463     NaN  NaN  CAT2   yes      NaN
3     107   1263     NaN  NaN  CAT4   yes      NaN
4     108   1642     NaN  NaN  CAT3    no      NaN
5     109    136     NaN  yes   NaN   NaN        1
6     110    143     NaN  yes   NaN   NaN        2
7     112    163     NaN  yes   NaN   NaN        4
8     111    162     NaN   no   NaN   NaN        3

In [85]:
pd.concat([data1, data2, data3], axis=1)

,CustID,Sales,Payback,Imp,CustID,Sales,Mode,Prime,CustID,Sales,Priority,Imp
8,101,13456.0,CAT4,yes,NaN,NaN,NaN,NaN,111,162.0,3,no
9,104,14563.0,CAT5,no,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
10,105,12563.0,CAT6,yes,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
11,106,16542.0,CAT7,yes,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,102,1365.0,CAT1,yes,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,103,1463.0,CAT2,yes,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,107,1263.0,CAT4,yes,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,108,1642.0,CAT3,no,NaN,NaN,NaN,NaN
5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,109,136.0,1,yes
6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,110,143.0,2,yes
7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,112,163.0,4,yes

In [86]:
data1 = {
  "name": ["Sally", "Mary", "John"],
  "age": [50, 40, 30]
}

In [87]:
data2 = {
  "name": ["Sally", "Peter", "Micky"],
  "age": [77, 44, 22]
}

In [88]:
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [89]:
df1.merge(df2, how='outer')

    name  age
0  Sally   50
1   Mary   40
2   John   30
3  Sally   77
4  Peter   44
5  Micky   22

In [90]:
df1.merge(df2, how='right')

    name  age
0  Sally   77
1  Peter   44
2  Micky   22